[
  {
    "segment": "Health-Conscious Professionals",
    "questions": [
      "What would your dream product do?",
      "What are the key features, qualities, functionalities, effects that you expect and why? What are the motivations and constraints behind those requests?",
      "How do you currently manage your nutrition?",
      "What challenges do you face in maintaining a healthy diet?",
      "How much time do you spend on meal planning and preparation?",
      "What tools or apps do you currently use for nutrition advice?",
      "How important is personalization in nutrition coaching for you?",
      "What would make you switch from your current solution to a new one?",
      "How do you integrate nutrition advice into your daily routine?",
      "What role does convenience play in your food choices?",
      "How do you measure the success of your nutrition efforts?",
      "What additional support would you find valuable in a nutrition coaching service?",
      "How do you prioritize your health and nutrition among other responsibilities?",
      "What are your long-term health goals?",
      "What would motivate you to invest in a nutrition coaching service?"
    ]
  },
  {
    "segment": "Corporate Wellness Programs",
    "questions": [
      "What would your dream product do?",
      "What are the key features, qualities, functionalities, effects that you expect and why? What are the motivations and constraints behind those requests?",
      "What current wellness initiatives does your company have in place?",
      "What challenges do you face in implementing wellness programs?",
      "How do you measure the effectiveness of your wellness programs?",
      "What feedback have you received from employees regarding nutrition support?",
      "How important is employee health to your company's overall productivity?",
      "What budget do you allocate for wellness programs?",
      "What would make you consider switching to a new wellness solution?",
      "How do you engage employees in wellness initiatives?",
      "What role does technology play in your wellness programs?",
      "What additional services would enhance your current wellness offerings?",
      "How do you prioritize employee satisfaction in your wellness strategy?",
      "What long-term goals do you have for employee health and wellness?",
      "What motivates you to invest in employee wellness solutions?"
    ]
  }
]